# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Dept': ['Sales','HR','Sales','HR','Sales','HR'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,351,350],
       'Amount': [2000,1200,34,122,2403,35]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Dept   Person  Sales  Amount
0    GOOG  Sales      Sam    200    2000
1    GOOG     HR  Charlie    120    1200
2    MSFT  Sales      Amy    340      34
3    MSFT     HR  Vanessa    124     122
4      FB  Sales     Carl    351    2403
5      FB     HR    Sarah    350      35

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [6]:
df.groupby('Company')

You can save this object as a new variable:

In [9]:
by_comp = df.groupby(["Company", 'Dept'])

And then call aggregate methods off the object:

In [10]:
by_comp.mean()

               Sales  Amount
Company Dept
FB      HR       350      35
        Sales    351    2403
GOOG    HR       120    1200
        Sales    200    2000
MSFT    HR       124     122
        Sales    340      34

In [11]:
by_comp = df.groupby(['Company'])

In [12]:
df.groupby('Company').mean()

         Sales  Amount
Company
FB       350.5  1219.0
GOOG     160.0  1600.0
MSFT     232.0    78.0

More examples of aggregate methods:

In [12]:
by_comp.std()

              Sales       Amount
Company
FB         0.707107  1674.428858
GOOG      56.568542   565.685425
MSFT     152.735065    62.225397

In [13]:
by_comp.min()

        Dept   Person  Sales  Amount
Company
FB        HR     Carl    350      35
GOOG      HR  Charlie    120    1200
MSFT      HR      Amy    124      34

In [14]:
by_comp.max()

          Dept   Person  Sales  Amount
Company
FB       Sales    Sarah    351    2403
GOOG     Sales      Sam    200    2000
MSFT     Sales  Vanessa    340     122

In [16]:
by_comp.max()[['Amount']]

         Amount
Company
FB         2403
GOOG       2000
MSFT        122

In [0]:
by_comp.count()

         Person  Sales  Amount
Company
FB            2      2       2
GOOG          2      2       2
MSFT          2      2       2

In [0]:
by_comp.describe()

        Amount                                                               \
         count    mean          std     min     25%     50%     75%     max
Company
FB         2.0  1219.0  1674.428858    35.0   627.0  1219.0  1811.0  2403.0
GOOG       2.0  1600.0   565.685425  1200.0  1400.0  1600.0  1800.0  2000.0
MSFT       2.0    78.0    62.225397    34.0    56.0    78.0   100.0   122.0

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  350.5    0.707107  350.0  350.25  350.5  350.75  351.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [20]:
pd.set_option('precision',2)

In [21]:
by_comp.describe().transpose()

Company            FB     GOOG    MSFT
Sales  count     2.00     2.00    2.00
       mean    350.50   160.00  232.00
       std       0.71    56.57  152.74
       min     350.00   120.00  124.00
       25%     350.25   140.00  178.00
       50%     350.50   160.00  232.00
       75%     350.75   180.00  286.00
       max     351.00   200.00  340.00
Amount count     2.00     2.00    2.00
       mean   1219.00  1600.00   78.00
       std    1674.43   565.69   62.23
       min      35.00  1200.00   34.00
       25%     627.00  1400.00   56.00
       50%    1219.00  1600.00   78.00
       75%    1811.00  1800.00  100.00
       max    2403.00  2000.00  122.00

In [0]:
by_comp.describe().transpose()['GOOG']

Amount  count       2.000000
        mean     1600.000000
        std       565.685425
        min      1200.000000
        25%      1400.000000
        50%      1600.000000
        75%      1800.000000
        max      2000.000000
Sales   count       2.000000
        mean      160.000000
        std        56.568542
        min       120.000000
        25%       140.000000
        50%       160.000000
        75%       180.000000
        max       200.000000
Name: GOOG, dtype: float64

# Great Job!